[{"patient_id": "P003", "text": "Patient: P003\nDate_of_Visit\tDescription_of_Symptoms\tFamily_History\tDoctors_Therapy\tDiagnosis\n2024-05-23\tskin rash with itching\tFather had hypertension.\tRecommended physical therapy for joint pain.\tI20.9 - Angina pectoris, unspecified\n2024-06-20\tblurred vision and dizziness\tFamily history of migraines.\tRecommended physical therapy for joint pain.\tI20.9 - Angina pectoris, unspecified\n2024-09-17\tpersistent headaches and fatigue\tFamily history of early-onset Alzheimer's.\tPrescribed omeprazole 20 mg for gastric issues.\tH52.1 - Myopia"}, {"patient_id": "P002", "text": "Patient: P002\nDate_of_Visit\tDescription_of_Symptoms\tFamily_History\tDoctors_Therapy\tDiagnosis\n2023-11-27\tblurred vision and dizziness\tFamily history of cardiovascular diseases.\tPrescribed omeprazole 20 mg for gastric issues.\tK30 - Functional dyspepsia\n2024-09-18\tskin rash with itching\tFamily history of migraines.\tPrescribed salbutamol inhaler for asthma symptoms.\tL20.9 - Atopic dermatitis, unspecified\n2023-11-17\tchest tightness and dizziness\tNo significant family history.\tRecommended physical therapy for joint pain.\tR51 - Headache"}, {"patient_id": "P004", "text": "Patient: P004\nDate_of_Visit\tDescription_of_Symptoms\tFamily_History\tDoctors_Therapy\tDiagnosis\n2024-08-04\tjoint pain and swelling\tFamily history of chronic respiratory conditions.\tPrescribed ibuprofen 400 mg.\tJ45.909 - Asthma, unspecified\n2024-07-24\tskin rash with itching\tFamily history of early-onset Alzheimer's.\tPrescribed ibuprofen 400 mg.\tL20.9 - Atopic dermatitis, unspecified\n2023-08-08\tdry cough and mild fever\tNo significant family history.\tPrescribed ibuprofen 400 mg.\tM25.5 - Pain in joint"}, {"patient_id": "P001", "text": "Patient: P001\nDate_of_Visit\tDescription_of_Symptoms\tFamily_History\tDoctors_Therapy\tDiagnosis\n2023-06-07\tfrequent urination and thirst\tFather experienced stroke at age 60.\tRecommended dietary changes for better glucose management.\tJ06.9 - Acute upper respiratory infection\n2023-10-25\tintermittent chest pain\tMother had breast cancer.\tPrescribed metformin 500 mg twice daily.\tH52.1 - Myopia\n2023-12-02\tskin rash with itching\tFamily history of early-onset Alzheimer's.\tPrescribed cetirizine 10 mg for allergy relief.\tJ45.909 - Asthma, unspecified"}]